meterhu/stm32f4/STM32F4BOOT/USER/SCR/LCD_RA8875.c
/*
*********************************************************************************************************
*
*	模块名称 : RA8875芯片驱动模块
*	文件名称 : LCD_RA8875.c
*	版    本 : V1.1
*	说    明 : RA8875底层驱动函数集。口线定义按安富莱 STM32-X2   （STM32F103VET6/LQFP100）
*	修改记录 :
*		版本号  日期       作者    说明
*		V1.0    2012-08-07 armfly  发布首版
*		V1.1    2012-10-23 armfly  解决绘制矩形函数的BUG（高度宽度计算错误）；增加SPI-4接口模式；
*								   解决几个绘制2D图形的函数判忙条件不真实的问题。
*								   触摸校准增加4点校准
*
*	Copyright (C), 2011-2012, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include <stdio.h>
#include <stdarg.h>
#include "stm32f4xx.h"
#include "stm32f4_std_libs.h"
#include "ucos_ii.h"
#include "mystd.h"
#include "m_config.h"
#include "LCD_RA8875.h"



/* 下面3个变量，主要用于使程序同时支持不同的屏 */
uint16_t g_ChipID = IC_8875;			/* 驱动芯片ID */
uint16_t g_LcdHeight = LCD_70_HEIGHT;		/* 显示屏分辨率-高度 */
uint16_t g_LcdWidth = LCD_70_WIDTH;			/* 显示屏分辨率-宽度 */



__IO uint16_t s_usTouchX, s_usTouchY;	/* 触摸屏ADC值 */
static __IO uint8_t s_ucRA8875Busy = 0;

/* 保存当前显示窗口的位置和大小，这几个变量由 RA8875_SetDispWin() 进行设置 */
static __IO uint16_t s_WinX = 0;
static __IO uint16_t s_WinY = 0;
static __IO uint16_t s_WinHeight = LCD_70_HEIGHT;
static __IO uint16_t s_WinWidth = LCD_70_WIDTH;

static void RA8875_WriteReg(uint8_t _ucRegAddr, uint8_t _ucRegValue);
static uint8_t RA8875_ReadReg(uint8_t _ucRegAddr);
static uint8_t RA8875_ReadStatus(void);

static void RA8875_SetReadCursor(uint16_t _usX, uint16_t _usY);
static void RA8875_SetTextCursor(uint16_t _usX, uint16_t _usY);

extern OS_EVENT *LCD_SEM;

#ifdef IF_SPI_EN
static uint8_t SPI_ShiftByte(uint8_t _ucByte);
void RA8875_HighSpeedSPI(void);
#endif

static void RA8875_Delaly1us(void)
{
	uint8_t i;

	for (i = 0; i < 10; i++);	/* 延迟, 不准 */
}

static void RA8875_Delaly1ms(void)
{
	uint16_t i;

	for (i = 0; i < 5000; i++);	/* 延迟1us, 不准 */
}


//两次触摸屏采样间隔,和AD采样速率有关
static void RA8875_Delaly200us(void)
{
	uint32_t i;

	for (i = 0; i < 3000; i++);	/* 延迟1us, 不准 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadID
*	功能说明: 读取LCD驱动芯片ID
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
uint16_t RA8875_ReadID(void)
{
	return RA8875_ReadReg(0x00);
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteCmd
*	功能说明: 写RA8875指令寄存器
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteCmd(uint8_t _ucRegAddr)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_CMD);
	SPI_ShiftByte(_ucRegAddr);
	RA8875_CS_1();

#else	/* 8080 总线 */
	RA8875_REG = _ucRegAddr;	/* 设置寄存器地址 */
#endif
}



/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteData
*	功能说明: 写RA8875指令寄存器
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteData(uint8_t _ucRegValue)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_DATA);
	SPI_ShiftByte(_ucRegValue);
	RA8875_CS_1();

#else	/* 8080 总线 */
	RA8875_RAM = _ucRegValue;	/* 设置寄存器地址 */
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadData
*	功能说明: 读RA8875寄存器值
*	形    参: 无
*	返 回 值: 寄存器值
*********************************************************************************************************
*/
uint8_t RA8875_ReadData(uint8_t _ucRegAddr)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	uint16_t value;

	RA8875_CS_0();
	SPI_ShiftByte(SPI_READ_DATA);
	value = SPI_ShiftByte(0x00);
	RA8875_CS_1();

	return value;
#else	/* 8080 总线 */
	uint8_t value;

	value = RA8875_RAM;		/* 读取寄存器值 */

	return value;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteData16
*	功能说明: 写RA8875数据总线，16bit，用于RGB显存写入
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8875_WriteData16(uint16_t _usRGB)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_DATA);
	SPI_ShiftByte(_usRGB >> 8);
	RA8875_CS_1();

	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_DATA);
	SPI_ShiftByte(_usRGB);
	RA8875_CS_1();

#else	/* 8080 总线 */
	RA8875_RAM = _usRGB;	/* 设置寄存器地址 */
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadData16
*	功能说明: 读RA8875显存，16bit RGB
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static uint16_t RA8875_ReadData16(void)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	uint16_t value;

	RA8875_CS_0();
	SPI_ShiftByte(SPI_READ_DATA);
	value = SPI_ShiftByte(0x00);
	RA8875_CS_1();

	return value;
#else	/* 8080 总线 */
	uint16_t value;

	value = RA8875_RAM;		/* 读取寄存器值 */
	value = RA8875_RAM;		/* 至少两次，防止花屏 */
	value = RA8875_RAM;		/* 读取寄存器值 */

	return value;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteReg
*	功能说明: 写RA8875寄存器. RA8875的寄存器地址和数据都是8bit的
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void RA8875_WriteReg(uint8_t _ucRegAddr, uint8_t _ucRegValue)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	s_ucRA8875Busy = 1;
	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_CMD);
	SPI_ShiftByte(_ucRegAddr);
	RA8875_CS_1();

	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_DATA);
	SPI_ShiftByte(_ucRegValue);
	RA8875_CS_1();
	s_ucRA8875Busy = 0;
#else	/* 8080 总线 */
	s_ucRA8875Busy = 1;
	RA8875_REG = _ucRegAddr;	/* 设置寄存器地址 */
	RA8875_RAM = _ucRegValue;	/* 写入寄存器值 */
	s_ucRA8875Busy = 0;
#endif
}

