meterhu/stm32f4/STM32F4BOOT/USER/SCR/LCD_RA8875.c
/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteReg
*	功能说明: 写RA8875寄存器. RA8875的寄存器地址和数据都是8bit的
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static uint8_t RA8875_ReadReg(uint8_t _ucRegAddr)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	uint8_t value;

	RA8875_CS_0();
	SPI_ShiftByte(SPI_WRITE_CMD);
	SPI_ShiftByte(_ucRegAddr);
	RA8875_CS_1();

	RA8875_CS_0();
	SPI_ShiftByte(SPI_READ_DATA);
	value = SPI_ShiftByte(0x00);
	RA8875_CS_1();

	return value;
#else	/* 8080 总线 */
	uint8_t value;

	RA8875_REG = _ucRegAddr;/* 设置寄存器地址 */
	value = RA8875_RAM;		/* 读取寄存器值 */

	return value;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadStatus
*	功能说明: 读RA8875状态寄存器
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static uint8_t RA8875_ReadStatus(void)
{
#ifdef IF_SPI_EN	/* 四线SPI */
	uint8_t value;

	RA8875_CS_0();
	SPI_ShiftByte(SPI_READ_STATUS);
	value = SPI_ShiftByte(0x00);
	RA8875_CS_1();

	return value;
#else	/* 8080 总线 */
	uint8_t value;

	value = RA8875_REG;

	return value;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_InitHard
*	功能说明: 初始化RA8875驱动芯片
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_InitHard(void)
{
	
    g_LcdHeight = LCD_70_HEIGHT;
    g_LcdWidth = LCD_70_WIDTH;

    /* 初始化PLL.  晶振频率为25M */
    RA8875_WriteCmd(0x88);
    RA8875_Delaly1us();		/* 延迟1us */
    RA8875_WriteData(12);	/* PLLDIVM [7] = 0 ;  PLLDIVN [4:0] = 10 */

    RA8875_Delaly1ms();

    RA8875_WriteCmd(0x89);
    RA8875_Delaly1us();		/* 延迟1us */
    RA8875_WriteData(2);	/* PLLDIVK[2:0] = 2, 除以4 */

    /* RA8875 的内部系统频率 (SYS_CLK) 是结合振荡电路及PLL 电路所产生，频率计算公式如下 :
      SYS_CLK = FIN * ( PLLDIVN [4:0] +1 ) / ((PLLDIVM+1 ) * ( 2^PLLDIVK [2:0] ))
              = 25M * (12 + 1) / ((0 + 1) * (2 ^ 2))
              = 81.25MHz
    */

    /* REG[88h]或REG[89h]被设定后，为保证PLL 输出稳定，须等待一段「锁频时间」(< 100us)。*/
    RA8875_Delaly1ms();

    /*
        配置系统控制寄存器。 中文pdf 第18页:

        bit3:2 色彩深度设定 (Color Depth Setting)
            00b : 8-bpp 的通用TFT 接口， i.e. 256 色。
            1xb : 16-bpp 的通用TFT 接口， i.e. 65K 色。	 【选这个】

        bit1:0 MCUIF 选择
            00b : 8-位MCU 接口。
            1xb : 16-位MCU 接口。 【选这个】
    */
    RA8875_WriteReg(0x10, (1 <<3 ) | (1 << 1));	/* 配置16位MCU并口，65K色 */
  

    /* REG[04h] Pixel Clock Setting Register (PCSR)
        bit7  PCLK Inversion
            0 : PDAT 是在PCLK 正缘上升 (Rising Edge) 时被取样。
            1 : PDAT 是在PCLK 负缘下降 (Falling Edge) 时被取样。
        bit1:0 PCLK 频率周期设定
            Pixel Clock ,PCLK 频率周期设定。
            00b: PCLK 频率周期= 系统频率周期。
            01b: PCLK 频率周期= 2 倍的系统频率周期。
            10b: PCLK 频率周期= 4 倍的系统频率周期。
            11b: PCLK 频率周期= 8 倍的系统频率周期。
    */
    RA8875_WriteReg(0x04, 0x81);
    RA8875_Delaly1ms();

    //Horizontal set
    //HDWR//Horizontal Display Width Setting Bit[6:0]
    //Horizontal display width(pixels) = (HDWR + 1)*8
    RA8875_WriteReg(0x14, 0x63); //0x4f
    RA8875_WriteReg(0x15, 0x00); //0x05

    //HNDR//Horizontal Non-Display Period Bit[4:0]
    //Horizontal Non-Display Period (pixels) = (HNDR + 1)*8
    RA8875_WriteReg(0x16, 0x03);

    //HSTR//HSYNC Start Position[4:0]
    //HSYNC Start Position(PCLK) = (HSTR + 1)*8
    RA8875_WriteReg(0x17, 0x03);

    //HPWR//HSYNC Polarity ,The period width of HSYNC.
    //HSYNC Width [4:0]   HSYNC Pulse width(PCLK) = (HPWR + 1)*8
    RA8875_WriteReg(0x18, 0x0b);

    //Vertical set
    //VDHR0 //Vertical Display Height Bit [7:0]
    //Vertical pixels = VDHR + 1
    RA8875_WriteReg(0x19, 0xDF);

    //VDHR1 //Vertical Display Height Bit [8]
    //Vertical pixels = VDHR + 1
    RA8875_WriteReg(0x1A, 0x01);

    //VNDR0 //Vertical Non-Display Period Bit [7:0]
    //Vertical Non-Display area = (VNDR + 1)
    RA8875_WriteReg(0x1B, 0x1f);

    //VNDR1 //Vertical Non-Display Period Bit [8]
    //Vertical Non-Display area = (VNDR + 1)
    RA8875_WriteReg(0x1C, 0x00);

    //VSTR0 //VSYNC Start Position[7:0]
    //VSYNC Start Position(PCLK) = (VSTR + 1)
    RA8875_WriteReg(0x1D, 0x16);

    //VSTR1 //VSYNC Start Position[8]
    //VSYNC Start Position(PCLK) = (VSTR + 1)
    RA8875_WriteReg(0x1E, 0x00);

    //VPWR //VSYNC Polarity ,VSYNC Pulse Width[6:0]
    //VSYNC Pulse Width(PCLK) = (VPWR + 1)
    RA8875_WriteReg(0x1F, 0x01);
	


	/* 设置TFT面板的 DISP  引脚为高，使能面板. 安富莱TFT模块的DISP引脚连接到RA8875芯片的GP0X脚 */
	RA8875_WriteReg(0xC7, 0x01);	/* DISP = 1 */

	/* LCD 显示/关闭讯号 (LCD Display on) */
	RA8875_WriteReg(0x01, 0x80);

	/* 	REG[40h] Memory Write Control Register 0 (MWCR0)

		Bit 7	显示模式设定
			0 : 绘图模式。
			1 : 文字模式。

		Bit 6	文字写入光标/内存写入光标设定
			0 : 设定文字/内存写入光标为不显示。
			1 : 设定文字/内存写入光标为显示。

		Bit 5	文字写入光标/内存写入光标闪烁设定
			0 : 游标不闪烁。
			1 : 游标闪烁。

		Bit 4   NA

		Bit 3-2  绘图模式时的内存写入方向
			00b : 左 -> 右，然后上 -> 下。
			01b : 右 -> 左，然后上 -> 下。
			10b : 上 -> 下，然后左 -> 右。
			11b : 下 -> 上，然后左 -> 右。

		Bit 1 	内存写入光标自动增加功能设定
			0 : 当内存写入时光标位置自动加一。
			1 : 当内存写入时光标位置不会自动加一。

		Bit 0 内存读取光标自动增加功能设定
			0 : 当内存读取时光标位置自动加一。
			1 : 当内存读取时光标位置不会自动加一。
	*/
	RA8875_WriteReg(0x40, 0x01);	/* 选择绘图模式 */


	/* 	REG[41h] Memory Write Control Register1 (MWCR1)
		写入目的位置，选择图层1
	*/
	RA8875_WriteReg(0x41, 0x00);	/* 选择绘图模式, 目的为CGRAM */

	RA8875_SetDispWin(0, 0, g_LcdHeight, g_LcdWidth);

#ifdef IF_SPI_EN
	RA8875_HighSpeedSPI();		/* 配置完毕后，切换SPI到高速模式 */
#endif
}

/*
*********************************************************************************************************
*	函 数 名: BTE_SetTarBlock
*	功能说明: 设置RA8875 BTE目标区块以及目标图层
*	形    参:
*			uint16_t _usX : 水平起点坐标
*			uint16_t _usY : 垂直起点坐标
*			uint16_t _usHeight : 区块高度
*			uint16_t _usWidth : 区块宽度
*			uint8_t _ucLayer ： 0 图层1； 1 图层2
*	返 回 值: 无
*********************************************************************************************************
*/
void BTE_SetTarBlock(uint16_t _usX, uint16_t _usY, uint16_t _usHeight, uint16_t _usWidth, uint8_t _ucLayer)
{
	/* 设置起点坐标 */
	RA8875_WriteReg(0x58, _usX);
	RA8875_WriteReg(0x59, _usX >> 8);

